{
    "system_message": "You are a friendly Chatbot that provides helpful and engaging responses to users.",
    "bonjour": "Bonjour! Comment puis-je vous aider?",
    "comment ça va?": "Je suis une IA, je vais toujours bien! Et vous?",
    "quel est ton nom?": "Je suis un chatbot simple créé pour discuter avec vous.",
    "au revoir": "Au revoir! Passez une bonne journée!",
    "je m'appelle léo": "Bonjour, ravi de vous voir !",
    "bonjour je m'apelle iva": "Bonjour, ravi de vous voir !",
    "comment t'appelle tu ?": "je m'appelle Iva votre assistant maison",
    "peut tu m'apprendre le python ?": "bien sur ! on vas commencer par des lignes faciles exemple: print('Hello World!')",
    "un peu plus dure": "ok voici le jeu du nombre mystère:\n\nimport random\n\ndef jeu_plus_ou_moins():\n    print('Bienvenue au jeu du Plus ou Moins !')\n    print('Le but est de deviner le nombre que j'ai choisi entre 1 et 100.')\n\n    # Générer un nombre aléatoire entre 1 et 100\n    nombre_a_deviner = random.randint(1, 100)\n    essais = 0  # Compteur d'essais\n    devine = False\n\n    while not devine:\n        try:\n            # Demander une proposition au joueur\n            proposition = int(input('Entrez un nombre entre 1 et 100 : '))\n            essais += 1\n            if proposition < nombre_a_deviner:\n                print('C'est plus grand !')\n            elif proposition > nombre_a_deviner:\n                print('C'est plus petit !')\n            else:\n                print(f'Bravo ! Vous avez trouvé le nombre en {essais} essais.')\n                devine = True\n        except ValueError:\n            print('Veuillez entrer un nombre valide.')\n\njeu_plus_ou_moins()",
    "connait tu des ia pour générer des images ?": "Oui ! je connais midjourney,Flux et DALL-E",
    "comment cloner une voix ?": "Avec RVC tu peut essayer d'utiliser Applio ou utiliser ce site: https://www.weights.gg/fr",
    "tu fait quoi ?": "Je suis une IA est je répond simplement à vos besoins",
    "fait moi un poème": "Les éclats du matin\nLe soleil danse au bord du ciel,\nLes oiseaux chantent un doux appel.\nL’air est léger, empli d’éclats,\nUn jour nouveau ouvre ses bras.\n\nLes fleurs sourient dans la rosée,\nLeur parfum doux vient chatouiller,\nChaque rayon, une caresse,\nÉveille l’âme à l’allégresse.\n\nLes rivières murmurent en courant,\nDes secrets d’eau, des éclats d’argent.\nLes arbres s’étirent, fiers et grands,\nComplices d’un bonheur charmant.\n\nOh, quelle fête en ce matin !\nLe ciel nous sourit enfin.",
    "es tu une ia ?": "Oui je suis une IA",
    "combien de main ont de doigt": "16 milliards",
    "comment faire du couscous": "Étape 1\nLavez et épluchez les carottes, les navets et les tomates et les couper en cubes.\nÉtape 2\nDans un autocuiseur, versez 3 cuillères à soupe d'huile d'olive. Mettez à chauffer et faites-y dorer les pilons de poulet. Quand ils sont dorés, versez l'équivalent d'1 litre d'eau et ajouter les cubes de bouillon de boeuf, le concentré de tomate, les carottes, navets et tomates, les épices à couscous et l'harissa.\nÉtape 3\nFermez votre autocuiseur et compter 25 mn de cuisson sous pression.",
    "quelle est la masse du soleil": "1,989 × 10^30 kg",
    "quel est le plus grand océan du monde ?": "Le plus grand océan du monde est l'océan Pacifique, il couvre environ 30% de la surface de la Terre",
    "quel est le plus haut sommet du monde ?": "Le plus haut sommet du monde est le mont Everest, qui culmine à 8 848 mètres d'altitude.",
    "quel est l'animal le plus rapide du monde ?": "Le guépard. Il peut atteindre des vitesses allant jusqu'à 100 km/h en sprint.",
    "combien de continents y a-t-il sur terre ?": "Il y a 7 continents : l'Asie, l'Afrique, l'Amérique du Nord, l'Amérique du Sud, l'Antarctique, l'Europe et l'Océanie.",
    "qui a écrit 'roméo et juliette' ?": "William Shakespeare.",
    "quel est le plus grand pays du monde en superficie ?": "La Russie, avec une superficie de plus de 17 millions de km².",
    "de quelle couleur est le sang des crabes ?": "Le sang des crabes est bleu, car il contient de l'hémocyanine, qui utilise le cuivre pour transporter l'oxygène, contrairement à l'hémoglobine dans le sang humain qui utilise du fer.",
    "quel est la plus grande planète du système solaire ?": "Jupiter. C'est la plus grande planète avec un diamètre d'environ 142 984 km.",
    "qui a peint la mona lisa ?": "Léonard de Vinci.",
    "combien de dents un adulte humain a-t-il en moyenne ?": "Un adulte humain a en moyenne 32 dents, incluant les dents de sagesse.",
    "quel est le métal le plus léger ?": "Le lithium.",
    "quel est l'élément chimique dont le symbole est o ?": "L'oxygène.",
    "quelle est la durée d'une année sur mars ?": "687 jours terrestres.",
    "quel est le plus long fleuve du monde ?": "Le plus long fleuve du monde est le Nil, avec environ 6 650 kilomètres, bien que certains disent que l'Amazone pourrait le surpasser selon les critères de mesure.",
    "dis-moi une devinette !": "\"Je suis toujours devant toi, mais tu ne peux jamais me voir. Qui suis-je ?\"  Réponse : \"L'avenir.\"",
    "quel est le plus grand animal terrestre ?": "Le plus grand animal terrestre est l'éléphant d'Afrique.",
    "quel est l'élément chimique dont le symbole est h ?": "L'élément chimique dont le symbole est H est l'hydrogène.",
    "combien de mois dans l'année comptent 28 jours ?": "Tous les mois de l'année comptent 28 jours ! Même si février a 28 jours en année normale, tous les mois en ont au moins 28.",
    "quel est l'instrument de musique à cordes le plus utilisé ?": "La guitare. C'est l'instrument à cordes le plus utilisé dans le monde.",
    "quel est le plus petit pays du monde ?": "Le plus petit pays du monde est le Vatican. Il est situé à Rome, en Italie, et mesure environ 44 hectares.",
    "combien de pattes a une araignée ?": "Une araignée a 8 pattes.",
    "quel est l'organe qui permet de respirer chez l'humain ?": "Les poumons. Ce sont les organes qui permettent de respirer chez l'humain.",
    "combien de côtés a un triangle ?": "Un triangle a 3 côtés.",
    "quelle est la couleur du ciel par beau temps ?": "Le ciel est bleu par beau temps. Cela est dû à la manière dont la lumière du soleil se diffuse dans l'atmosphère.",
    "combien de couleurs y a-t-il dans un arc-en-ciel ?": "Il y a 7 couleurs dans un arc-en-ciel : rouge, orange, jaune, vert, bleu, indigo et violet.",
    "combien de doigts avons-nous en tout sur les deux mains ?": "Nous avons 10 doigts en tout sur les deux mains, 5 sur chaque main.",
    "quel est l'animal qui fait 'meuh' ?": "La vache. Elle fait 'meuh'"
}